RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/pin_packages/cyhal_psoc6_04_80_tqfp.c
/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[6] = {
    {0u, 0u, P0_4, P0_4_SCB0_UART_RTS},
    {1u, 0u, P2_2, P2_2_SCB1_UART_RTS},
    {4u, 0u, P7_2, P7_2_SCB4_UART_RTS},
    {2u, 0u, P9_2, P9_2_SCB2_UART_RTS},
    {1u, 0u, P10_2, P10_2_SCB1_UART_RTS},
    {5u, 0u, P11_2, P11_2_SCB5_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[8] = {
    {0u, 0u, P0_2, P0_2_SCB0_UART_RX},
    {1u, 0u, P2_0, P2_0_SCB1_UART_RX},
    {2u, 0u, P3_0, P3_0_SCB2_UART_RX},
    {5u, 0u, P5_0, P5_0_SCB5_UART_RX},
    {4u, 0u, P7_0, P7_0_SCB4_UART_RX},
    {4u, 0u, P8_0, P8_0_SCB4_UART_RX},
    {2u, 0u, P9_0, P9_0_SCB2_UART_RX},
    {1u, 0u, P10_0, P10_0_SCB1_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[8] = {
    {0u, 0u, P0_3, P0_3_SCB0_UART_TX},
    {1u, 0u, P2_1, P2_1_SCB1_UART_TX},
    {2u, 0u, P3_1, P3_1_SCB2_UART_TX},
    {5u, 0u, P5_1, P5_1_SCB5_UART_TX},
    {4u, 0u, P7_1, P7_1_SCB4_UART_TX},
    {4u, 0u, P8_1, P8_1_SCB4_UART_TX},
    {2u, 0u, P9_1, P9_1_SCB2_UART_TX},
    {1u, 0u, P10_1, P10_1_SCB1_UART_TX},
};

/* Connections for: smif_spi_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_clk[1] = {
    {0u, 0u, P11_7, P11_7_SMIF_SPI_CLK},
};

/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {0u, 0u, P11_6, P11_6_SMIF_SPI_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {0u, 0u, P11_5, P11_5_SMIF_SPI_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {0u, 0u, P11_4, P11_4_SMIF_SPI_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {0u, 0u, P11_3, P11_3_SMIF_SPI_DATA3},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[1] = {
    {0u, 0u, P11_2, P11_2_SMIF_SPI_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[1] = {
    {0u, 0u, P11_1, P11_1_SMIF_SPI_SELECT1},
};

/* Connections for: smif_spi_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select2[1] = {
    {0u, 0u, P10_7, P10_7_SMIF_SPI_SELECT2},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[53] = {
    {0u, 0u, P0_0, P0_0_TCPWM0_LINE0},
    {1u, 0u, P0_0, P0_0_TCPWM0_LINE256},
    {0u, 1u, P0_2, P0_2_TCPWM0_LINE1},
    {1u, 1u, P0_2, P0_2_TCPWM0_LINE257},
    {0u, 2u, P0_4, P0_4_TCPWM0_LINE2},
    {1u, 2u, P0_4, P0_4_TCPWM0_LINE258},
    {0u, 3u, P2_0, P2_0_TCPWM0_LINE3},
    {1u, 3u, P2_0, P2_0_TCPWM0_LINE259},
    {0u, 0u, P2_2, P2_2_TCPWM0_LINE0},
    {1u, 4u, P2_2, P2_2_TCPWM0_LINE260},
    {0u, 1u, P2_4, P2_4_TCPWM0_LINE1},
    {1u, 5u, P2_4, P2_4_TCPWM0_LINE261},
    {0u, 2u, P2_6, P2_6_TCPWM0_LINE2},
    {1u, 6u, P2_6, P2_6_TCPWM0_LINE262},
    {0u, 3u, P3_0, P3_0_TCPWM0_LINE3},
    {1u, 7u, P3_0, P3_0_TCPWM0_LINE263},
    {0u, 0u, P5_0, P5_0_TCPWM0_LINE0},
    {1u, 0u, P5_0, P5_0_TCPWM0_LINE256},
    {0u, 1u, P5_6, P5_6_TCPWM0_LINE1},
    {1u, 1u, P5_6, P5_6_TCPWM0_LINE257},
    {0u, 3u, P6_2, P6_2_TCPWM0_LINE3},
    {1u, 3u, P6_2, P6_2_TCPWM0_LINE259},
    {0u, 0u, P6_4, P6_4_TCPWM0_LINE0},
    {1u, 4u, P6_4, P6_4_TCPWM0_LINE260},
    {0u, 1u, P6_6, P6_6_TCPWM0_LINE1},
    {1u, 5u, P6_6, P6_6_TCPWM0_LINE261},
    {0u, 2u, P7_0, P7_0_TCPWM0_LINE2},
    {1u, 6u, P7_0, P7_0_TCPWM0_LINE262},
    {0u, 3u, P7_2, P7_2_TCPWM0_LINE3},
    {1u, 7u, P7_2, P7_2_TCPWM0_LINE263},
    {0u, 2u, P8_0, P8_0_TCPWM0_LINE2},
    {1u, 2u, P8_0, P8_0_TCPWM0_LINE258},
    {0u, 0u, P9_0, P9_0_TCPWM0_LINE0},
    {1u, 4u, P9_0, P9_0_TCPWM0_LINE260},
    {0u, 1u, P9_2, P9_2_TCPWM0_LINE1},
    {1u, 5u, P9_2, P9_2_TCPWM0_LINE261},
    {1u, 0u, P9_4, P9_4_TCPWM0_LINE256},
    {0u, 2u, P10_0, P10_0_TCPWM0_LINE2},
    {1u, 6u, P10_0, P10_0_TCPWM0_LINE262},
    {0u, 3u, P10_2, P10_2_TCPWM0_LINE3},
    {1u, 7u, P10_2, P10_2_TCPWM0_LINE263},
    {0u, 0u, P10_4, P10_4_TCPWM0_LINE0},
    {1u, 0u, P10_4, P10_4_TCPWM0_LINE256},
    {0u, 1u, P10_6, P10_6_TCPWM0_LINE1},
    {1u, 1u, P10_6, P10_6_TCPWM0_LINE257},
    {0u, 3u, P11_2, P11_2_TCPWM0_LINE3},
    {1u, 3u, P11_2, P11_2_TCPWM0_LINE259},
    {0u, 0u, P11_4, P11_4_TCPWM0_LINE0},
    {1u, 4u, P11_4, P11_4_TCPWM0_LINE260},
    {0u, 1u, P11_6, P11_6_TCPWM0_LINE1},
    {1u, 5u, P11_6, P11_6_TCPWM0_LINE261},
    {0u, 3u, P12_6, P12_6_TCPWM0_LINE3},
    {1u, 7u, P12_6, P12_6_TCPWM0_LINE263},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[53] = {
    {0u, 0u, P0_1, P0_1_TCPWM0_LINE_COMPL0},
    {1u, 0u, P0_1, P0_1_TCPWM0_LINE_COMPL256},
    {0u, 1u, P0_3, P0_3_TCPWM0_LINE_COMPL1},
    {1u, 1u, P0_3, P0_3_TCPWM0_LINE_COMPL257},
    {0u, 2u, P0_5, P0_5_TCPWM0_LINE_COMPL2},
    {1u, 2u, P0_5, P0_5_TCPWM0_LINE_COMPL258},
    {0u, 3u, P2_1, P2_1_TCPWM0_LINE_COMPL3},
    {1u, 3u, P2_1, P2_1_TCPWM0_LINE_COMPL259},
    {0u, 0u, P2_3, P2_3_TCPWM0_LINE_COMPL0},
    {1u, 4u, P2_3, P2_3_TCPWM0_LINE_COMPL260},
    {0u, 1u, P2_5, P2_5_TCPWM0_LINE_COMPL1},
    {1u, 5u, P2_5, P2_5_TCPWM0_LINE_COMPL261},
    {0u, 2u, P2_7, P2_7_TCPWM0_LINE_COMPL2},
    {1u, 6u, P2_7, P2_7_TCPWM0_LINE_COMPL262},
    {0u, 3u, P3_1, P3_1_TCPWM0_LINE_COMPL3},
    {1u, 7u, P3_1, P3_1_TCPWM0_LINE_COMPL263},
    {0u, 0u, P5_1, P5_1_TCPWM0_LINE_COMPL0},
    {1u, 0u, P5_1, P5_1_TCPWM0_LINE_COMPL256},
    {0u, 1u, P5_7, P5_7_TCPWM0_LINE_COMPL1},
    {1u, 1u, P5_7, P5_7_TCPWM0_LINE_COMPL257},
    {0u, 3u, P6_3, P6_3_TCPWM0_LINE_COMPL3},
    {1u, 3u, P6_3, P6_3_TCPWM0_LINE_COMPL259},
    {0u, 0u, P6_5, P6_5_TCPWM0_LINE_COMPL0},
    {1u, 4u, P6_5, P6_5_TCPWM0_LINE_COMPL260},
    {0u, 1u, P6_7, P6_7_TCPWM0_LINE_COMPL1},
    {1u, 5u, P6_7, P6_7_TCPWM0_LINE_COMPL261},
    {0u, 2u, P7_1, P7_1_TCPWM0_LINE_COMPL2},
    {1u, 6u, P7_1, P7_1_TCPWM0_LINE_COMPL262},
    {0u, 3u, P7_3, P7_3_TCPWM0_LINE_COMPL3},
    {1u, 7u, P7_3, P7_3_TCPWM0_LINE_COMPL263},
    {0u, 2u, P8_1, P8_1_TCPWM0_LINE_COMPL2},
    {1u, 2u, P8_1, P8_1_TCPWM0_LINE_COMPL258},
    {0u, 0u, P9_1, P9_1_TCPWM0_LINE_COMPL0},
    {1u, 4u, P9_1, P9_1_TCPWM0_LINE_COMPL260},
    {0u, 1u, P9_3, P9_3_TCPWM0_LINE_COMPL1},
    {1u, 5u, P9_3, P9_3_TCPWM0_LINE_COMPL261},
    {1u, 0u, P9_5, P9_5_TCPWM0_LINE_COMPL256},
    {0u, 2u, P10_1, P10_1_TCPWM0_LINE_COMPL2},
    {1u, 6u, P10_1, P10_1_TCPWM0_LINE_COMPL262},
    {0u, 3u, P10_3, P10_3_TCPWM0_LINE_COMPL3},
    {1u, 7u, P10_3, P10_3_TCPWM0_LINE_COMPL263},
    {0u, 0u, P10_5, P10_5_TCPWM0_LINE_COMPL0},
    {1u, 0u, P10_5, P10_5_TCPWM0_LINE_COMPL256},
    {0u, 1u, P10_7, P10_7_TCPWM0_LINE_COMPL1},
    {1u, 1u, P10_7, P10_7_TCPWM0_LINE_COMPL257},
    {0u, 3u, P11_3, P11_3_TCPWM0_LINE_COMPL3},
    {1u, 3u, P11_3, P11_3_TCPWM0_LINE_COMPL259},
    {0u, 0u, P11_5, P11_5_TCPWM0_LINE_COMPL0},
    {1u, 4u, P11_5, P11_5_TCPWM0_LINE_COMPL260},
    {0u, 1u, P11_7, P11_7_TCPWM0_LINE_COMPL1},
    {1u, 5u, P11_7, P11_7_TCPWM0_LINE_COMPL261},
    {0u, 3u, P12_7, P12_7_TCPWM0_LINE_COMPL3},
    {1u, 7u, P12_7, P12_7_TCPWM0_LINE_COMPL263},
};

/* Connections for: tcpwm_tr_one_cnt_in */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_tr_one_cnt_in[62] = {
    {0u, 0u, P0_0, P0_0_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P0_1, P0_1_TCPWM0_TR_ONE_CNT_IN1},
    {0u, 2u, P0_2, P0_2_TCPWM0_TR_ONE_CNT_IN2},
    {0u, 3u, P0_3, P0_3_TCPWM0_TR_ONE_CNT_IN3},
    {1u, 0u, P0_4, P0_4_TCPWM0_TR_ONE_CNT_IN256},
    {1u, 1u, P0_5, P0_5_TCPWM0_TR_ONE_CNT_IN257},
    {1u, 2u, P1_0, P1_0_TCPWM0_TR_ONE_CNT_IN258},
    {1u, 3u, P1_1, P1_1_TCPWM0_TR_ONE_CNT_IN259},
    {1u, 4u, P1_2, P1_2_TCPWM0_TR_ONE_CNT_IN260},
    {1u, 5u, P2_0, P2_0_TCPWM0_TR_ONE_CNT_IN261},
    {1u, 6u, P2_1, P2_1_TCPWM0_TR_ONE_CNT_IN262},
    {1u, 7u, P2_2, P2_2_TCPWM0_TR_ONE_CNT_IN263},
    {0u, 0u, P2_3, P2_3_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P2_4, P2_4_TCPWM0_TR_ONE_CNT_IN1},
    {0u, 2u, P2_5, P2_5_TCPWM0_TR_ONE_CNT_IN2},
    {0u, 3u, P2_6, P2_6_TCPWM0_TR_ONE_CNT_IN3},
    {1u, 0u, P2_7, P2_7_TCPWM0_TR_ONE_CNT_IN256},
    {1u, 1u, P3_0, P3_0_TCPWM0_TR_ONE_CNT_IN257},
    {1u, 2u, P3_1, P3_1_TCPWM0_TR_ONE_CNT_IN258},
    {1u, 3u, P5_0, P5_0_TCPWM0_TR_ONE_CNT_IN259},
    {1u, 4u, P5_1, P5_1_TCPWM0_TR_ONE_CNT_IN260},
    {1u, 5u, P5_2, P5_2_TCPWM0_TR_ONE_CNT_IN261},
    {1u, 6u, P5_6, P5_6_TCPWM0_TR_ONE_CNT_IN262},
    {1u, 7u, P5_7, P5_7_TCPWM0_TR_ONE_CNT_IN263},
    {0u, 0u, P6_2, P6_2_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P6_3, P6_3_TCPWM0_TR_ONE_CNT_IN1},
    {0u, 2u, P6_4, P6_4_TCPWM0_TR_ONE_CNT_IN2},
    {0u, 3u, P6_5, P6_5_TCPWM0_TR_ONE_CNT_IN3},
    {1u, 0u, P6_6, P6_6_TCPWM0_TR_ONE_CNT_IN256},
    {1u, 1u, P6_7, P6_7_TCPWM0_TR_ONE_CNT_IN257},
    {1u, 2u, P7_0, P7_0_TCPWM0_TR_ONE_CNT_IN258},
    {1u, 3u, P7_1, P7_1_TCPWM0_TR_ONE_CNT_IN259},
    {1u, 4u, P7_2, P7_2_TCPWM0_TR_ONE_CNT_IN260},
    {1u, 5u, P7_3, P7_3_TCPWM0_TR_ONE_CNT_IN261},
    {1u, 6u, P7_4, P7_4_TCPWM0_TR_ONE_CNT_IN262},
    {1u, 7u, P7_5, P7_5_TCPWM0_TR_ONE_CNT_IN263},
    {0u, 0u, P7_7, P7_7_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P8_0, P8_0_TCPWM0_TR_ONE_CNT_IN1},
    {0u, 2u, P8_1, P8_1_TCPWM0_TR_ONE_CNT_IN2},
    {0u, 3u, P9_0, P9_0_TCPWM0_TR_ONE_CNT_IN3},
    {1u, 0u, P9_1, P9_1_TCPWM0_TR_ONE_CNT_IN256},
    {1u, 1u, P9_2, P9_2_TCPWM0_TR_ONE_CNT_IN257},
    {1u, 2u, P9_3, P9_3_TCPWM0_TR_ONE_CNT_IN258},
    {1u, 3u, P9_4, P9_4_TCPWM0_TR_ONE_CNT_IN259},
    {1u, 4u, P9_5, P9_5_TCPWM0_TR_ONE_CNT_IN260},
    {1u, 5u, P10_0, P10_0_TCPWM0_TR_ONE_CNT_IN261},
    {1u, 6u, P10_1, P10_1_TCPWM0_TR_ONE_CNT_IN262},
    {1u, 7u, P10_2, P10_2_TCPWM0_TR_ONE_CNT_IN263},
    {0u, 0u, P10_3, P10_3_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P10_4, P10_4_TCPWM0_TR_ONE_CNT_IN1},
    {0u, 2u, P10_5, P10_5_TCPWM0_TR_ONE_CNT_IN2},
    {0u, 3u, P10_6, P10_6_TCPWM0_TR_ONE_CNT_IN3},
    {1u, 0u, P10_7, P10_7_TCPWM0_TR_ONE_CNT_IN256},
    {1u, 1u, P11_1, P11_1_TCPWM0_TR_ONE_CNT_IN257},
    {1u, 2u, P11_2, P11_2_TCPWM0_TR_ONE_CNT_IN258},
    {1u, 3u, P11_3, P11_3_TCPWM0_TR_ONE_CNT_IN259},
    {1u, 4u, P11_4, P11_4_TCPWM0_TR_ONE_CNT_IN260},
    {1u, 5u, P11_5, P11_5_TCPWM0_TR_ONE_CNT_IN261},
    {1u, 6u, P11_6, P11_6_TCPWM0_TR_ONE_CNT_IN262},
    {1u, 7u, P11_7, P11_7_TCPWM0_TR_ONE_CNT_IN263},
    {0u, 0u, P12_6, P12_6_TCPWM0_TR_ONE_CNT_IN0},
    {0u, 1u, P12_7, P12_7_TCPWM0_TR_ONE_CNT_IN1},
};

/* Connections for: usb_usb_dm_pad */
const cyhal_resource_pin_mapping_t cyhal_pin_map_usb_usb_dm_pad[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: usb_usb_dp_pad */
const cyhal_resource_pin_mapping_t cyhal_pin_map_usb_usb_dp_pad[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

#endif
